app/controllers/homeworks_controller.rb

	def create
		@homework = HomeworkType.new(homework_params)
		@homework.lecture = Lecture.find(params[:lecture_id])
		@homework.student = current_user
		@homework.score = 0
		if @homework.save
---
SELECT  "lectures".* FROM "lectures"  WHERE "lectures"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "homeworks" ("created_at", "lecture_id", "score", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-22 11:53:43.293028"], ["lecture_id", 2], ["score", 0], ["student_id", 980190964], ["updated_at", "2014-07-22 11:53:43.293028"]]

	def destroy
		@homework.destroy
---
DELETE FROM "homeworks" WHERE "homeworks"."id" = ?  [["id", 1]]

	def rate
		@homework.score = params[:score]
		if @homework.save
---
UPDATE "homeworks" SET "score" = ?, "updated_at" = ? WHERE "homeworks"."id" = 1  [["score", 100], ["updated_at", "2014-07-22 11:53:43.522346"]]