app/controllers/lectures_controller.rb

INSERT INTO "lectures" ("created_at", "name", "subject_id", "teacher_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-22 11:53:43.904723"], ["name", "Lecture"], ["subject_id", 1], ["teacher_id", 980190963], ["updated_at", "2014-07-22 11:53:43.904723"]]
---
	def create
		@lecture = LectureType.new(lecture_params)
		@lecture.teacher = current_user
		if @lecture.save

DELETE FROM "lectures" WHERE "lectures"."id" = ?  [["id", 1]]
---
	def destroy
		@lecture.destroy

SELECT "lectures".* FROM "lectures"
---
	def index
		@lectures = Lecture.all