app/controllers/students_controller.rb

	def subscribe_to_subject
		@student.subjects << Subject.find(params[:subject_id])
---
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@student = Users::StudentRegistrationType.new(student_params)

		if @student.save
---
INSERT INTO "students" ("confirmation_token", "created_at", "email", "password_digest", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def destroy
		sign_out
		@student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 980190963]]

	def index
  		@search = Student.search(params[:q])
---
SELECT "students".* FROM "students"

  def update_password
    @student = Users::StudentPasswordUpdateType.find(params[:id])
    if @student.update_attributes(student_password_update_params)
---
UPDATE "students" SET "confirmation_token" = ?, "password_digest" = ?, "updated_at" = ? WHERE "students"."id" = 980190963  [["confirmation_token", "-gL7BmB9vYIHxWNQ8TaUNw"], ["password_digest", "$2a$04$ar/VwMEp53GXAhu9PbCBpu/rWcfCoaIo7aP5yHPFYpWODCgQxeiZ6"], ["updated_at", "2014-07-22 11:53:43.184392"]]

		def set_student
			@student = Student.find(params[:id])
---
SELECT  "students".* FROM "students"  WHERE "students"."id" = ? LIMIT 1  [["id", 980190964]]