app/controllers/teachers_controller.rb

	def create
		@teacher = Users::TeacherRegistrationType.new(teacher_params)

		if @teacher.save
---
INSERT INTO "teachers" ("confirmation_token", "created_at", "email", "password_digest", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def index
		@teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

	def destroy
		sign_out
		@teacher.destroy
---
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 980190963]]

	def registration_confirm
		@teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers"  WHERE "teachers"."id" = ? LIMIT 1  [["id", 980190963]]

  def update_password
    @teacher = Users::TeacherPasswordUpdateType.find(params[:id])
    if @teacher.update_attributes(teacher_password_update_params)
---
UPDATE "teachers" SET "confirmation_token" = ?, "password_digest" = ?, "updated_at" = ? WHERE "teachers"."id" = 980190963  [["confirmation_token", "jL1ashmEYPCDybOhrGUDXw"], ["password_digest", "$2a$04$5g716C40Xmk9XTVGyhzFcuMWMLztfLK1ni8aR2ax4hjAQ6jZao3Zi"], ["updated_at", "2014-07-22 11:53:43.806194"]]

	def set_teacher
		@teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers"  WHERE "teachers"."id" = ? LIMIT 1  [["id", 980190964]]